/*############################################################################

############################################################################*/

#include "main.h"

//############################################################################
//Init ADC
void ADC_Init(void)
//############################################################################
{
  ADCSRA = 0xA6;  // ADC 使能,连线转换模式,分频因子64
  ADMUX = 7;      // ADC7 此脚用于测量电池电压U_BAT
  ADCSRA |= 0x40; // ADC开始转换,启动首次转换
}

//############################################################################
//读取当前电流值
void AdConvert(void)
//############################################################################
/*补充注释：
AD采样，进入时保存比较器端口
然后切换到AD采样，采样工作电流，并移动加权平均算法过滤之
完成后恢复到之前的比较器端口
*/
{
 unsigned int i=0;  
 unsigned char sense;
  
  sense = ADMUX;   // 保存当前设置
  ADMUX  =  0x06;  // 通道6 AD6
  SFIOR  =  0x00;  // 关闭模拟比较器多路复用
  ADCSRA =  0xD3;  // AD转换开始, 单次转换,8分频
  ADCSRA |= 0x10;  // 清除中断标志
  ADMUX  =  0x06;  // 通道6 AD6
  ADCSRA |= 0x40;  // AD单次转换开始
  while (((ADCSRA & 0x10) == 0)); //等待中断标志置位,等待转换完成
  ADMUX = sense;   //恢复模拟多路复用器的先前值
  i = ADCW * 4;
  if(i > 200) i = 200;
  Strom = (i + Strom * 7) / 8; 
  if (Strom_max < Strom) Strom_max = Strom;
  ADCSRA = 0x00;  // 关闭AD转换器
  SFIOR = 0x08;   // 使能模拟比较器多路复用//，ADC多路复用器的输出为模拟比较器的负极输入。
}


